validation_case/Haggen_Poiseuilli/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../0/include/initialConditions"

transportModel Newtonian;

// Laminar viscosity
nu              $flowNu;

// Thermal expansion coefficient
beta            $thermalBeta;

// Reference temperature
TRef            $bulkTemp;

// Laminar Prandtl number
Pr              $regularPr;

// Turbulent Prandtl number
Prt             $turbulentPr;

// Characteristic Length
Lc              $domainLength;

// Wall Temperature
Twall           $wallTemp;

// lambda Guess
lambda0           $lambdaGuess;

// lambda Guess
Lc           $domainLength;

// Average velocity in flow direction
Ubar            $flowUbar;

// Average velocity in flow direction
delay            $lambdaDelay;

// Average velocity in flow direction
interval            $lambdaInterval;
// ************************************************************************* //
