validation_case/Haggen_Poiseuilli/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20000;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //
functions
{
    Nu1
    {
        // Mandatory entries (unmodifiable)
        type        heatTransferCoeff;
        libs        (fieldFunctionObjects);

        // Mandatory (inherited) entries (runtime modifiable)
        field       T;
        patches     (walls);
        htcModel    localReferenceTemperature;

        // Optional entries (runtime modifable)
        L           1.0;
        kappa       1.0;
    }
}
