validation_case/Haggen_Poiseuilli/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    Phi
    {
        $p;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner
        {
                preconditioner  GAMG;
                smoother        DICGaussSeidel;
                tolerance       1e-6;
        }
        tolerance       1e-6;
    }

    "(U|h|thetaBar|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.01;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 3;
    PhiRefCell  0;
    PhiRefValue 0;
}

SIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-6;
        U               1e-6;
        h               1e-6;
        thetaBar        1e-6;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-5;
    }
}

relaxationFactors
{
    fields
    {
        rho             1.0;
        p_rgh           0.7;
    }
    equations
    {
        U               0.3;
        "(h|thetaBar)"  0.3;
        "(k|epsilon|omega)" 0.7;
    }
}


// ************************************************************************* //
